In [1]:
train_file_path = r"D:\Bala\Adult_Census_Income_Prediction\income\artifact\data_ingestion\2024-04-25-00-55-07\ingested_data\train\adult.csv"

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(train_file_path)

In [4]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,36,Private,414683,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Black,Male,0,0,40,United-States,<=50K
1,24,Private,285432,HS-grad,9,Never-married,Exec-managerial,Own-child,White,Male,0,0,40,United-States,<=50K
2,47,Self-emp-inc,206947,Assoc-acdm,12,Widowed,Exec-managerial,Not-in-family,White,Female,0,0,67,United-States,<=50K
3,27,Private,617860,Some-college,10,Never-married,Handlers-cleaners,Own-child,Black,Male,0,0,40,United-States,<=50K
4,23,Private,193090,Bachelors,13,Never-married,Adm-clerical,Own-child,White,Female,0,0,30,United-States,<=50K

In [5]:
df.shape

(26048, 15)

# Target_columns

In [6]:
df["salary"]

0         <=50K
1         <=50K
2         <=50K
3         <=50K
4         <=50K
          ...
26043      >50K
26044     <=50K
26045      >50K
26046      >50K
26047     <=50K
Name: salary, Length: 26048, dtype: object

In [7]:
x,y=df.drop(columns='salary',axis=1),df['salary']

In [8]:
x.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country
0,36,Private,414683,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Black,Male,0,0,40,United-States
1,24,Private,285432,HS-grad,9,Never-married,Exec-managerial,Own-child,White,Male,0,0,40,United-States
2,47,Self-emp-inc,206947,Assoc-acdm,12,Widowed,Exec-managerial,Not-in-family,White,Female,0,0,67,United-States
3,27,Private,617860,Some-college,10,Never-married,Handlers-cleaners,Own-child,Black,Male,0,0,40,United-States
4,23,Private,193090,Bachelors,13,Never-married,Adm-clerical,Own-child,White,Female,0,0,30,United-States

In [9]:
y.head()

0     <=50K
1     <=50K
2     <=50K
3     <=50K
4     <=50K
Name: salary, dtype: object

In [10]:
x.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
country           0
dtype: int64

In [11]:
y.isna().sum()

0

In [12]:
import yaml

In [13]:
schema_file = r"D:\Bala\Adult_Census_Income_Prediction\config\schema.yaml"

def read_yaml_file(file_path:str) -> dict:
    """
    Reads a Yaml file and returns the contents as a dictionary.
    file_path:str
    """
    with open(file_path,"rb") as yaml_file:
        return yaml.safe_load(yaml_file)

In [14]:
schema = read_yaml_file(schema_file)

In [25]:
cat_features_list = list(schema['categorical_columns'])

In [26]:
cat_features_list

['workclass',
 'education',
 'marital-status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'country',
 'salary']

In [17]:
import numpy as np

In [20]:
for i in cat_features_list:
    unique_values=[j for j in x[i].unique()]
    print(i)
 
    for k in unique_values:
        if k not in schema['domain_value'][i]:
            if k == " ?":
                x[i]=x[i].replace(" ?",np.nan)
    print("-------------------------")

workclass
-------------------------
education
-------------------------
marital-status
-------------------------
occupation
-------------------------
relationship
-------------------------
race
-------------------------
sex
-------------------------
country
-------------------------

In [21]:
x['workclass'].unique()

array([' Private', ' Self-emp-inc', nan, ' Self-emp-not-inc',
       ' State-gov', ' Local-gov', ' Federal-gov', ' Without-pay',
       ' Never-worked'], dtype=object)

In [22]:
x.isna().sum()

age                  0
workclass         1466
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        1473
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
country            461
dtype: int64

#Need to work on this null values

In [27]:
numerical_features_list = list(schema['numerical_columns'])
numerical_features_list

['age',
 'fnlwgt',
 'education-num',
 'capital-gain',
 'capital-loss',
 'hours-per-week']

In [28]:
numerical_df = x[numerical_features_list]
numerical_df.head()

   age  fnlwgt  education-num  capital-gain  capital-loss  hours-per-week
0   36  414683             13             0             0              40
1   24  285432              9             0             0              40
2   47  206947             12             0             0              67
3   27  617860             10             0             0              40
4   23  193090             13             0             0              30

In [30]:
categprical_df = x[cat_features_list[:-1]]
categprical_df.head()

,workclass,education,marital-status,occupation,relationship,race,sex,country
0,Private,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Black,Male,United-States
1,Private,HS-grad,Never-married,Exec-managerial,Own-child,White,Male,United-States
2,Self-emp-inc,Assoc-acdm,Widowed,Exec-managerial,Not-in-family,White,Female,United-States
3,Private,Some-college,Never-married,Handlers-cleaners,Own-child,Black,Male,United-States
4,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,United-States

In [23]:
from sklearn.impute import SimpleImputer

# Numerical Column

In [31]:
simple_imputer = SimpleImputer(strategy='mean')

simple_imputer.fit_transform(numerical_df)

array([[3.60000e+01, 4.14683e+05, 1.30000e+01, 0.00000e+00, 0.00000e+00,
        4.00000e+01],
       [2.40000e+01, 2.85432e+05, 9.00000e+00, 0.00000e+00, 0.00000e+00,
        4.00000e+01],
       [4.70000e+01, 2.06947e+05, 1.20000e+01, 0.00000e+00, 0.00000e+00,
        6.70000e+01],
       ...,
       [4.00000e+01, 8.59950e+04, 6.00000e+00, 0.00000e+00, 0.00000e+00,
        4.00000e+01],
       [4.50000e+01, 1.59816e+05, 1.40000e+01, 0.00000e+00, 1.97700e+03,
        3.50000e+01],
       [2.70000e+01, 2.95799e+05, 1.00000e+01, 0.00000e+00, 0.00000e+00,
        4.00000e+01]])

In [33]:
df = simple_imputer.transform(numerical_df)

In [34]:
simple_imputer.feature_names_in_

array(['age', 'fnlwgt', 'education-num', 'capital-gain', 'capital-loss',
       'hours-per-week'], dtype=object)

#The ".statistics_" can be used to get the mean value of each column

In [35]:
simple_imputer.statistics_

array([3.85830390e+01, 1.89671061e+05, 1.00769733e+01, 1.09429300e+03,
       8.72348741e+01, 4.04355037e+01])

In [36]:
x['age'].mean()

38.583039004914006

# Categorical Column

In [37]:
simple_imputer_cat = SimpleImputer(strategy="most_frequnt")

In [ ]:
df_cat = simple_imputer_cat.fit_transform(categprical_df)

# Create Custum Transformer

In [ ]:
class FeatureGenerator:

    def __init__(self,strategy="median") -> None:
        self.strategy = strategy

    def fit(self,X):
        self.features = X.columns
        self.statistic_ = []

        for column in X.columns:
            self.statistic_.append(X[column].median())

    def transform(self,X):
        for idx,column in enumerate(X.columns):
            X[column].fillna(self.statistic_[idx])

    def fit_transform(self,X):
        self.fit(X)
        return self.transform(X)

# If we are using the TransformerMixin as inherit then we can ignore the fit_transform. bcoz it will be available in the Transformermixin

In [ ]:
class FeatureGenerator(BaseEstimator,TransformerMixin):

    def __init__(self,strategy="median") -> None:
        self.strategy = strategy

    def fit(self,X):
        self.features = X.columns
        self.statistic_ = []

        for column in X.columns:
            self.statistic_.append(X[column].median())

    def transform(self,X):
        for idx,column in enumerate(X.columns):
            X[column].fillna(self.statistic_[idx])